<a href="https://colab.research.google.com/github/MaximTislenko/GB_med_stat_R/blob/main/%D0%A1%D0%BE%D0%B7%D0%B4_%D0%BD%D0%B0%D0%B1%D0%BE%D1%80%D0%B0_05.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Создание набора данных

In [1]:
library(tidyverse)
library(readxl)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.4.4     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ purrr::%||%()   masks base::%||%()
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

# Основы управления данными

In [2]:
leadership <- data.frame(
  manager = c(1, 2, 3, 4, 5),
  date = c("10/24/08", "10/28/08", "10/1/08", "10/12/08", "5/1/09"),
  country = c("US", "US", "UK", "UK", "UK"),
  gender = c("M", "F", "F", "M", "F"),
  age = c(32, 45, 25, 39, 99),
  q1 = c(5, 3, 3, 3, 2),
  q2 = c(4, 5, 5, 3, 2),
  q3 = c(5, 2, 5, 4, 1),
  q4 = c(5, 5, 5, NA, 2),
  q5 = c(5, 5, 2, NA, 1)
  )

leadership

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5   5  5
2 2       10/28/08 US      F      45  3  5  2   5  5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
5 5       5/1/09   UK      F      99  2  2  1   2  1

## Создание новых переменных

Чаще всего используется операция присваивания:

переменная <- выражение

* $+$ -  Сложение
* $-$ - Вычитание
* $*$ - Умножение
* $/$ - Деление
* ^ или $**$ - Возведение в степень
* x%%y -  Деление по модулю (остаток от деления) x на y: 5%%2=1
* x%/%y -  Деление нацело x на y: 5%/%2=2

In [3]:
# первый способ
leadership$total_score <- leadership$q1 + leadership$q2 + leadership$q3 + leadership$q4 + leadership$q5
leadership$mean_score <- (leadership$q1 + leadership$q2 + leadership$q3 + leadership$q4 + leadership$q5)/5
leadership

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      99  2  2  1   2  1  8          1.6

In [4]:
# второй способ
leadership <- transform(leadership,
total_score = q1 + q2 + q3 + q4 + q5,
mean_score = (q1 + q2 + q3 + q4 + q5)/5)
leadership

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      99  2  2  1   2  1  8          1.6

## Перекодирование переменных
Логические переменные:
* $<$ - Меньше, чем
* $<=$ - Меньше или равно
* $>$ - Больше, чем
* $>=$ - Больше или равно
* $==$ - Точно равно
* $!=$ - Не равно
* $!x$ - Инверсия x (НЕ x)
* $x | y$ - x ИЛИ y
* x&y - x И y
* $isTRUE(x)$ -Проверяет истинность значения x

Задачи:
* преобразовать непрерывные данные в категориальные;
* заменить ошибочные данные правильными значениями;
* создать переменную типа «сдал / не сдал» на основе экзаменационных баллов.

In [5]:
leadership$age[leadership$age == 99] <- NA
leadership

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      NA  2  2  1   2  1  8          1.6

In [6]:
#  используется функция within, она похожа на with, но позволяет модифицировать таблицу
leadership <- within(leadership,{
  agecat <- NA
  agecat[age > 75] <- "Elder"
  agecat[age >= 55 & age <= 75] <- "Middle Aged"
  agecat[age < 55] <- "Young"
  })
leadership
# дополнительные функции перекодирования recode() - в пакете car, recodeVar() - в пакете doBy, cut() - R

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      NA  2  2  1   2  1  8          1.6
  agecat
1 Young
2 Young
3 Young
4 Young
5 NA

## Переименование переменных (столбцов)

$fix(leadership)$ - откроет интерактивный редактор

или

$names(leadership)[2] <- "testDate"$

In [7]:
names(leadership)
names(leadership)[2] <- "testDate"
leadership

 [1] "manager"     "date"        "country"     "gender"      "age"
 [6] "q1"          "q2"          "q3"          "q4"          "q5"
[11] "total_score" "mean_score"  "agecat"

  manager testDate country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      NA  2  2  1   2  1  8          1.6
  agecat
1 Young
2 Young
3 Young
4 Young
5 NA

In [8]:
names(leadership)[6:10] <- c("item1", "item2", "item3", "item4", "item5")
leadership

  manager testDate country gender age item1 item2 item3 item4 item5 total_score
1 1       10/24/08 US      M      32  5     4     5      5     5    24
2 2       10/28/08 US      F      45  3     5     2      5     5    20
3 3       10/1/08  UK      F      25  3     5     5      5     2    20
4 4       10/12/08 UK      M      39  3     3     4     NA    NA    NA
5 5       5/1/09   UK      F      NA  2     2     1      2     1     8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

## Пропущенные значения

Функция $is.na()$:

\>y <- c(1, 2, 3, NA)

\>is.na(y)

Результат:

c(FALSE, FALSE, FALSE, TRUE)

Функция $is.infinite()$ - положительная и отрицательная бесконечности

In [9]:
is.na(leadership[,6:10])

     item1 item2 item3 item4 item5
[1,] FALSE FALSE FALSE FALSE FALSE
[2,] FALSE FALSE FALSE FALSE FALSE
[3,] FALSE FALSE FALSE FALSE FALSE
[4,] FALSE FALSE FALSE  TRUE  TRUE
[5,] FALSE FALSE FALSE FALSE FALSE

In [10]:
is.na(leadership[,])

     manager testDate country gender age   item1 item2 item3 item4 item5
[1,] FALSE   FALSE    FALSE   FALSE  FALSE FALSE FALSE FALSE FALSE FALSE
[2,] FALSE   FALSE    FALSE   FALSE  FALSE FALSE FALSE FALSE FALSE FALSE
[3,] FALSE   FALSE    FALSE   FALSE  FALSE FALSE FALSE FALSE FALSE FALSE
[4,] FALSE   FALSE    FALSE   FALSE  FALSE FALSE FALSE FALSE  TRUE  TRUE
[5,] FALSE   FALSE    FALSE   FALSE   TRUE FALSE FALSE FALSE FALSE FALSE
     total_score mean_score agecat
[1,] FALSE       FALSE      FALSE
[2,] FALSE       FALSE      FALSE
[3,] FALSE       FALSE      FALSE
[4,]  TRUE        TRUE      FALSE
[5,] FALSE       FALSE       TRUE

### Перекодирование значений в отсутствующие

```
leadership\$age[leadership\$age == 99] <- NA
```

### Исключение пропущенных значений из анализа

```
x <- c(1, 2, NA, 3)
y <- x[1] + x[2] + x[3] + x[4]
z <- sum(x)
```
Функция `na.omit()` - построчное удаление если есть пропущенные значения.

In [11]:
x <- c(1, 2, NA, 3)
y <- x[1] + x[2] + x[3] + x[4]
z <- sum(x)
z
y
x

[1] NA

[1] NA

[1]  1  2 NA  3

In [12]:
y <- sum (x, na.rm = TRUE)
y

[1] 6

In [13]:
leadership
newdata <- na.omit (leadership)
newdata

  manager testDate country gender age item1 item2 item3 item4 item5 total_score
1 1       10/24/08 US      M      32  5     4     5      5     5    24
2 2       10/28/08 US      F      45  3     5     2      5     5    20
3 3       10/1/08  UK      F      25  3     5     5      5     2    20
4 4       10/12/08 UK      M      39  3     3     4     NA    NA    NA
5 5       5/1/09   UK      F      NA  2     2     1      2     1     8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

  manager testDate country gender age item1 item2 item3 item4 item5 total_score
1 1       10/24/08 US      M      32  5     4     5     5     5     24
2 2       10/28/08 US      F      45  3     5     2     5     5     20
3 3       10/1/08  UK      F      25  3     5     5     5     2     20
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young

## Календарные даты

В R даты обычно вводятся в виде текстовых строк, а затем преобразуются в формат даты и хранятся в числовом виде. Для этого преобразования используется функция `as.Date()`, имеющая следующий синтаксис:

`as.Date(x, "input_format")`

где x – это дата в текстовом формате, а input_format определяет
формат представления даты:
* %d - День месяца в виде числа (01–31)
* %a - Сокращенное название дня недели
* %A - Полное название дня недели
* %m - Порядковый номер месяца (01–12)
* %b - Сокращенное название месяца
* %B - Полное название месяца
* %y - Две последние цифры года
* %Y - Все четыре цифры года

Функция `Sys.Date()` возвращает текущую дату, а функция `date()` – текущие дату и время.

Для вывода дат в заданном формате и извлечения отдельных компонентов можно использовать функцию `format(x, format="output_ format")`

In [14]:
# По умолчанию даты вводятся в формате yyyy-mm-dd («год-месяц-день»)
mydates <- as.Date(c("2007-06-22", "2004-02-13")) # преобразует текстовые данные в даты, используя этот формат по умолчанию.
mydates

[1] "2007-06-22" "2004-02-13"

In [15]:
# В отличие от нее, следующая инструкция:
strDates <- c("01/05/1965", "08/16/1975")
dates <- as.Date(strDates, "%m/%d/%Y") # читает даты в формате mm/dd/yyyy («месяц/день/год»).
dates

[1] "1965-01-05" "1975-08-16"

In [16]:
leadership

  manager testDate country gender age item1 item2 item3 item4 item5 total_score
1 1       10/24/08 US      M      32  5     4     5      5     5    24
2 2       10/28/08 US      F      45  3     5     2      5     5    20
3 3       10/1/08  UK      F      25  3     5     5      5     2    20
4 4       10/12/08 UK      M      39  3     3     4     NA    NA    NA
5 5       5/1/09   UK      F      NA  2     2     1      2     1     8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

In [17]:
# В нашем наборе данных leadership даты представлены в формате mm/dd/yy. Поэтому в инструкциях
myformat <- "%m/%d/%y"
leadership$testDate <- as.Date(leadership$testDate, myformat) # используется нестандартный формат, позволяющий прочитать текстовую
                                                      # переменную и преобразовать ее в столбец, содержащий календарные даты.
leadership

  manager testDate   country gender age item1 item2 item3 item4 item5
1 1       2008-10-24 US      M      32  5     4     5      5     5
2 2       2008-10-28 US      F      45  3     5     2      5     5
3 3       2008-10-01 UK      F      25  3     5     5      5     2
4 4       2008-10-12 UK      M      39  3     3     4     NA    NA
5 5       2009-05-01 UK      F      NA  2     2     1      2     1
  total_score mean_score agecat
1 24          4.8        Young
2 20          4.0        Young
3 20          4.0        Young
4 NA           NA        Young
5  8          1.6        NA

In [18]:
Sys.Date()
date()

[1] "2024-06-09"

[1] "Sun Jun  9 08:31:26 2024"

In [19]:
today <- Sys.Date()
format(today, format="%B %d %Y")
format(today, format="%A")

[1] "June 09 2024"

[1] "Sunday"

In [20]:
# С датами можно производить арефметические действия
startdate <- as.Date("2020-02-13")
enddate <- as.Date("2021-01-22")
days <- enddate - startdate
days

Time difference of 344 days

In [21]:
today <- Sys.Date()
dob <- as.Date("1956-10-12")
difftime(today, dob, units="weeks")

Time difference of 3530.286 weeks

# Преобразование дат в текстовые переменные
Также есть возможность преобразовать данные в формате даты и времени в текстовые значения, хотя это бывает нужно не так часто. Это можно сделать при помощи функции `as.character()`:

`strDates <- as.character(dates)`

Это позволяет применять к датам многие текстовые функции (разделение на подгруппы, замена, конкатенация и т. д.).

### Дополнительно
Чтобы узнать больше о преобразовании текстовых переменных в даты, загляните в справку `help(as.Date)` и `help(strftime)`. Также дополнительную информацию о форматах даты и времени можно найти в `help(ISOdatetime)`. Пакет lubridate содержит множество функций, упрощающих работу с датами, в том числе функции, обнаруживающие данные в формате даты и времени и извлекающие отдельные составляющие таких данных (например, годы, месяцы, дни и т. д.), а также выполняющие арифметические операции с ними. Если вам нужно произвести сложные вычисления с датами, воспользуйтесь пакетом fCalendar. В нем содержится несметное число функций для работы с датами. Эти функции позволяют одновременно работать с несколькими часовыми поясами и совершать сложные операции с календарем, распознавая рабочие, выходные и праздничные дни.

## Преобразование данных из одного типа в другой
Функции:
* `is.тип_данных()` - возвращают TRUE или FALSE,
* `as.тип_данных()` - преобразуют данные в соответствующий формат.


---
* is.numeric() ----------- as.numeric()
* is.character() --------- as.character()
* is.vector() -------------- as.vector()
* is.matrix() -------------- as.matrix()
* is.data.frame() ------- as.data.frame()
* is.factor() --------------- as.factor()
* is.logical() -------------- as.logical()

## Сортировка данных

Используется функция `order()`. По умолчанию данные сортируются в порядке возрастания. Можно использовать знак минус перед показателем, тогда будет обратная сортировка по убыванию.

In [22]:
# по возрасту в порядке возрастания
newdata <- leadership[order(leadership$age),]
newdata

  manager testDate   country gender age item1 item2 item3 item4 item5
3 3       2008-10-01 UK      F      25  3     5     5      5     2
1 1       2008-10-24 US      M      32  5     4     5      5     5
4 4       2008-10-12 UK      M      39  3     3     4     NA    NA
2 2       2008-10-28 US      F      45  3     5     2      5     5
5 5       2009-05-01 UK      F      NA  2     2     1      2     1
  total_score mean_score agecat
3 20          4.0        Young
1 24          4.8        Young
4 NA           NA        Young
2 20          4.0        Young
5  8          1.6        NA

In [23]:
# по возрасту в порядке убывания
newdata <- leadership[order(-leadership$age),]
newdata

  manager testDate   country gender age item1 item2 item3 item4 item5
2 2       2008-10-28 US      F      45  3     5     2      5     5
4 4       2008-10-12 UK      M      39  3     3     4     NA    NA
1 1       2008-10-24 US      M      32  5     4     5      5     5
3 3       2008-10-01 UK      F      25  3     5     5      5     2
5 5       2009-05-01 UK      F      NA  2     2     1      2     1
  total_score mean_score agecat
2 20          4.0        Young
4 NA           NA        Young
1 24          4.8        Young
3 20          4.0        Young
5  8          1.6        NA

In [24]:
# по полу а затем по возрасту в пределах каждого пола
newdata <- leadership[order(leadership$gender, leadership$age),]
newdata

  manager testDate   country gender age item1 item2 item3 item4 item5
3 3       2008-10-01 UK      F      25  3     5     5      5     2
2 2       2008-10-28 US      F      45  3     5     2      5     5
5 5       2009-05-01 UK      F      NA  2     2     1      2     1
1 1       2008-10-24 US      M      32  5     4     5      5     5
4 4       2008-10-12 UK      M      39  3     3     4     NA    NA
  total_score mean_score agecat
3 20          4.0        Young
2 20          4.0        Young
5  8          1.6        NA
1 24          4.8        Young
4 NA           NA        Young

In [25]:
# по полу а затем по возрасту (на убывание) в пределах каждого пола
newdata <- leadership[order(leadership$gender, -leadership$age),]
newdata

  manager testDate   country gender age item1 item2 item3 item4 item5
2 2       2008-10-28 US      F      45  3     5     2      5     5
3 3       2008-10-01 UK      F      25  3     5     5      5     2
5 5       2009-05-01 UK      F      NA  2     2     1      2     1
4 4       2008-10-12 UK      M      39  3     3     4     NA    NA
1 1       2008-10-24 US      M      32  5     4     5      5     5
  total_score mean_score agecat
2 20          4.0        Young
3 20          4.0        Young
5  8          1.6        NA
4 NA           NA        Young
1 24          4.8        Young

## Объединение наборов данных

Если данные существуют в виде разрозненных фрагментов, их нужно объединить, прежде чем двигаться дальше. В этом разделе я расскажу, как добавлять столбцы (переменные) и строки (наблюдения) в таблицы данных.

### Добавление столбцов

Для объединения двух таблиц можно использовать функцию merge(). В большинстве случаев две таблицы объединяются по значениям одной или нескольких ключевых переменных. К примеру, инструкция:
```
total <- merge(dataframeA, dataframeB, by="ID")
```
объединит таблицы данных dataframeA и dataframeB по значениям переменной ID. Аналогично инструкция:

```
total <- merge(dataframeA, dataframeB, by=c("ID","Country"))
```
объединит две таблицы данных по значениям переменных ID
и Country. Подобное соединение таблиц данных по горизонта-
ли часто используется для добавления переменных в таблицы
данных.

### Объединение по горизонтали с помощью cbind()
Если нужно просто объединить две матрицы или таблицы данных по горизонтали без указания общего ключа, по которому должно выполняться объединение, можно использовать функцию `cbind()`:
```
total <- cbind(A, B)
```
Эта функция объединяет объекты A и B по горизонтали. Чтобы функция работала правильно, каждый объект должен иметь одинаковое число строк, расположенных в одинаковом порядке.

### Добавление строк

Для объединения двух таблиц данных по вертикали можно использовать функцию `rbind()`:
```
total <- rbind(dataframeA, dataframeB)
```
Объединяемые таблицы должны содержать одинаковые наборы переменных, но не обязательно в одной и той же последовательности. Если в таблице dataframeA есть переменные, отсутствующие в dataframeB, то перед объединением нужно сделать одно из двух:
* удалить лишние переменные из таблицы dataframeA;
* создать дополнительные переменные в таблице dataframeB и присвоить им значения NA (пропущенные).

Объединение по вертикали обычно используется для добавления наблюдений из одной таблицы данных в другую.

## Разделение наборов данных на составлющие

В R имеются обширные возможности для извлечения отдельных элементов из объектов. Их можно использовать для выбора определенных переменных и/или наблюдений. В следующих разделах обсуждается несколько способов выбора переменных и наблюдений.

### Выбор переменных
Часто бывает так, что новый набор данных создается из небольшого числа переменных, выбранных из большего набора данных. В главе 2 вы узнали, как выбирать элементы таблицы данных при помощи инструкции вида -  `таблица_данных[номера_строк, номера_столбцов]`. Этот прием можно использовать также для выбора отдельных переменных. Например, инструкция:
```
newdata <- leadership[,c(6:10)]
```
выберет переменные q1, q2, q3, q4 и q5 из таблицы данных leadership
и сохранит их в таблице данных newdata. Если номера строк не ука-
заны (,), то по умолчанию выбираются все строки.

Инструкции:
```
vars <- c("item1", "item2", "item3", "item4", "item5")
newdata <-leadership[, vars]
```
выберут те же самые переменные. В этом случае имена перемен-
ных (в кавычках) обозначают извлекаемые переменные.

Наконец, тот же результат можно получить с помощью инструкций:
```
myvars <- paste("item", 1:5, sep="")
newdata <- leadership[myvars]
```
Этот пример создаст тот же вектор, что и предыдущий, но на этот раз с использованием функции `paste()`. Эту функцию мы подробно рассмотрим позже.

In [26]:
newdata <- leadership[,c(6:10)]
newdata

  item1 item2 item3 item4 item5
1 5     4     5      5     5
2 3     5     2      5     5
3 3     5     5      5     2
4 3     3     4     NA    NA
5 2     2     1      2     1

In [27]:
vars <- c("item1", "item2", "item3", "item4", "item5")
newdata <- leadership[, vars]
newdata

  item1 item2 item3 item4 item5
1 5     4     5      5     5
2 3     5     2      5     5
3 3     5     5      5     2
4 3     3     4     NA    NA
5 2     2     1      2     1

In [28]:
# можно и так ,запятая перед vars подрозумевается
vars <- c("item1", "item2", "item3", "item4", "item5")
newdata <- leadership[vars]
newdata

  item1 item2 item3 item4 item5
1 5     4     5      5     5
2 3     5     2      5     5
3 3     5     5      5     2
4 3     3     4     NA    NA
5 2     2     1      2     1

In [29]:
myvars <- paste("item", 1:5, sep="")
newdata <- leadership[myvars]
newdata

  item1 item2 item3 item4 item5
1 5     4     5      5     5
2 3     5     2      5     5
3 3     5     5      5     2
4 3     3     4     NA    NA
5 2     2     1      2     1

### Исключение переменных из выборки

Существует много причин, когда желательно исключить переменные из выборки. Например, если переменная содержит несколько пропущенных значений, то может понадобиться удалить ее до начала анализа. Рассмотрим несколько способов исключения переменных.

Переменные item4 и item5 можно исключить с помощью следующих инструкций:
```
myvars <- names(leadership) %in% c("item4", "item5")
newdata <- leadership[!myvars]
```
Зная, что item4 и item5 – это девятая и десятая переменные, можно ис-
ключить их так:


```
newdata <- leadership[c(-9,-10)]
или
newdata <- leadership[-c(9,10)]
```



Минус (-) перед номером столбца означает, что этот столбец
следует исключить.

Наконец, эти же два столбца можно исключить инструкцией


```
leadership$item4 <- leadership$item5 <- NULL
```

Здесь переменным item4 и item5 присваивается неопределенное значение (NULL). Обратите внимание, что NULL – это не то же самое, что NA (отсутствующие значения).

Исключение переменных – действие, противоположное выборке. Выбор между этими действиями зависит от того, какое из них проще записать. Если нужно исключить много переменных, то часто проще выбрать все остальные, и наоборот.

In [30]:
myvars <- names(leadership) %in% c("item4", "item5")
newdata <- leadership[!myvars]
newdata

  manager testDate   country gender age item1 item2 item3 total_score
1 1       2008-10-24 US      M      32  5     4     5     24
2 2       2008-10-28 US      F      45  3     5     2     20
3 3       2008-10-01 UK      F      25  3     5     5     20
4 4       2008-10-12 UK      M      39  3     3     4     NA
5 5       2009-05-01 UK      F      NA  2     2     1      8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

In [31]:
newdata <- leadership[c(-9,-10)]
newdata

  manager testDate   country gender age item1 item2 item3 total_score
1 1       2008-10-24 US      M      32  5     4     5     24
2 2       2008-10-28 US      F      45  3     5     2     20
3 3       2008-10-01 UK      F      25  3     5     5     20
4 4       2008-10-12 UK      M      39  3     3     4     NA
5 5       2009-05-01 UK      F      NA  2     2     1      8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

In [32]:
newdata <- leadership[-c(9,10)]
newdata

  manager testDate   country gender age item1 item2 item3 total_score
1 1       2008-10-24 US      M      32  5     4     5     24
2 2       2008-10-28 US      F      45  3     5     2     20
3 3       2008-10-01 UK      F      25  3     5     5     20
4 4       2008-10-12 UK      M      39  3     3     4     NA
5 5       2009-05-01 UK      F      NA  2     2     1      8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

In [33]:
leadership$item4 <- leadership$item5 <- NULL
leadership

  manager testDate   country gender age item1 item2 item3 total_score
1 1       2008-10-24 US      M      32  5     4     5     24
2 2       2008-10-28 US      F      45  3     5     2     20
3 3       2008-10-01 UK      F      25  3     5     5     20
4 4       2008-10-12 UK      M      39  3     3     4     NA
5 5       2009-05-01 UK      F      NA  2     2     1      8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

### Выборка наблюдений
Выбор или удаление наблюдений (строк) – это в большинстве случаев залог успешной подготовки данных и их анализа. В листинге 3.6 показано несколько примеров.

In [34]:
# Выбрать строки с 1 по 3 (первые три наблюдения)
newdata <- leadership[1:3,]
newdata

  manager testDate   country gender age item1 item2 item3 total_score
1 1       2008-10-24 US      M      32  5     4     5     24
2 2       2008-10-28 US      F      45  3     5     2     20
3 3       2008-10-01 UK      F      25  3     5     5     20
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young

In [35]:
# Выбрать всех мужчин старше 30 лет
newdata <- leadership[leadership$gender=="M" & leadership$age > 30,]
newdata

  manager testDate   country gender age item1 item2 item3 total_score
1 1       2008-10-24 US      M      32  5     4     5     24
4 4       2008-10-12 UK      M      39  3     3     4     NA
  mean_score agecat
1 4.8        Young
4  NA        Young

In [36]:
leadership$testDate <- as.Date(leadership$testDate, "%m/%d/%y") # Преобразовать даты из текстового формата в формат дат (мм/дд/гг).
startdate <- as.Date("2009-01-01") # Задать начальную дату.
enddate <- as.Date("2009-12-31") # Задать конечную дату.
# Выбрать наблюдения, удовлетворяющие заданному критерию, как мы уже делали это в предыдущем примере.
newdata <- leadership[which(leadership$testDate >= startdate & leadership$testDate <= enddate),]
newdata

  manager testDate   country gender age item1 item2 item3 total_score
5 5       2009-05-01 UK      F      NA  2     2     1     8
  mean_score agecat
5 1.6        NA

### Функция subset()

Функция `subset()` – самый простой, пожалуй, способ выбора пе-
ременных и наблюдений. Вот два примера:

In [38]:
leadership

  manager testDate   country gender age item1 item2 item3 total_score
1 1       2008-10-24 US      M      32  5     4     5     24
2 2       2008-10-28 US      F      45  3     5     2     20
3 3       2008-10-01 UK      F      25  3     5     5     20
4 4       2008-10-12 UK      M      39  3     3     4     NA
5 5       2009-05-01 UK      F      NA  2     2     1      8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

In [40]:
# Выберет все строки, где значение переменной age больше или равно 35 или меньше 24,
# оставляя в них только переменные с item1 по item3.
newdata <- subset(leadership, age >= 35 | age < 23,
select=c(item1, item2, item3))
newdata

  item1 item2 item3
2 3     5     2
4 3     3     4

In [41]:
# Выберет всех мужчин старше 25 лет, оставляя в выбранных строках
# переменные с gender по item3 (gender, item3 и все столбцы между ними).
newdata <- subset(leadership, gender=="M" & age > 25, select=gender:item3)
newdata

  gender age item1 item2 item3
1 M      32  5     4     5
4 M      39  3     3     4

### Выборка случайных наблюдений
```
mysample <- leadership[sample(1:nrow(leadership), 3, replace=FALSE),]
```
Первый аргумент функции `sample()` – это вектор с номерами наблюдений, из числа которых будет получена выборка. Здесь вектор состоит из чисел от единицы до числа наблюдений в таблице данных. Второй аргумент – это число элементов в выборке, а третий аргумент указывает, что выборка должна быть создана без замещения. Функция `sample()` возвращает случайно выбранные элементы из вектора в первом аргументе, которые затем используются для выбора строк из таблицы данных.

Существует более специализированная функция `sample.int()`.

R обладает обширными возможностями создания выборок, включая извлечение и проверку пробных выборок (пакет `sampling`) и анализ сложных выборочных данных (пакет `survey`).

In [46]:
mysample <- leadership[sample(1:nrow(leadership), 3, replace=FALSE),]
mysample

  manager testDate   country gender age item1 item2 item3 total_score
4 4       2008-10-12 UK      M      39  3     3     4     NA
3 3       2008-10-01 UK      F      25  3     5     5     20
1 1       2008-10-24 US      M      32  5     4     5     24
  mean_score agecat
4  NA        Young
3 4.0        Young
1 4.8        Young

## Использование `dplyr` для работы с таблицами данных

До этого момента для работы с таблицами данных мы использовали базовые функции R. Однако существует также пакет `dplyr`, включающий функции, которые позволяют решать те же задачи более простым способом. Он быстро превратился в один из самых популярных пакетов R для управления данными.

### Основные функции из пакета `dplyr`

* `select()` - Выбирает переменные/столбцы
* `filter()` - Выбирает наблюдения/строки
* `mutate()` - Преобразует переменные
* `rename()` - Переименовывает переменные/столбцы
* `recode()` - Перекодирует значения переменных
* `arrange()` - Упорядочивает строки по значениям переменных

In [47]:
leadership <- data.frame(
manager = c(1, 2, 3, 4, 5),
date = c("10/24/08", "10/28/08", "10/1/08", "10/12/08", "5/1/09"),
country = c("US", "US", "UK", "UK", "UK"),
gender = c("M", "F", "F", "M", "F"),
age = c(32, 45, 25, 39, 99),
q1 = c(5, 3, 3, 3, 2),
q2 = c(4, 5, 5, 3, 2),
q3 = c(5, 2, 5, 4, 1),
q4 = c(5, 5, 5, NA, 2),
q5 = c(5, 5, 2, NA, 1)
)
leadership

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5   5  5
2 2       10/28/08 US      F      45  3  5  2   5  5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
5 5       5/1/09   UK      F      99  2  2  1   2  1

In [48]:
# Создать две сводные переменные.
leadership <- mutate(leadership,total_score = q1 + q2 + q3 + q4 + q5, mean_score = total_score / 5)
leadership

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      99  2  2  1   2  1  8          1.6

In [49]:
# Перекодировать значения "M" и "F" в значения "male" и "female".
leadership$gender <- recode(leadership$gender,"M" = "male", "F" = "female")
leadership

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      male   32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      female 45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      female 25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      male   39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      female 99  2  2  1   2  1  8          1.6

In [50]:
# Переименовать переменные manager и gender.
leadership <- rename(leadership, ID = "manager", sex = "gender")
leadership

  ID date     country sex    age q1 q2 q3 q4 q5 total_score mean_score
1 1  10/24/08 US      male   32  5  4  5   5  5 24          4.8
2 2  10/28/08 US      female 45  3  5  2   5  5 20          4.0
3 3  10/1/08  UK      female 25  3  5  5   5  2 20          4.0
4 4  10/12/08 UK      male   39  3  3  4  NA NA NA           NA
5 5  5/1/09   UK      female 99  2  2  1   2  1  8          1.6

In [ ]:
# Отсортировать данные по переменной sex и затем каждый пол по сумме баллов.